# Pandas

# Welcome to <a href="http://www.themenyouwanttobe.com"> TheMenYouWantToBe </a>

Pandas is an open source library built on top of Numpy. Pandas is a BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. 

It allows for fast analysis and Data Cleaning and Preparation.<br>
It excels in performance and productivity.<br>
It also has built-in visualization features.<br>
It can work with data from a wide variety of Sources.

### Index

1. Series
2. Data Frames
3. Missing Data
4. Group By
5. Merging, Joining and Concatenation
6. Operations
7. Data Input and Output

For More always refer to <a href = "http://pandas.pydata.org/pandas-docs/stable/">Pandas Documentation Page</a>

# Series

	Series	1D labeled homogeneously-typed array

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c','d']  # Create a list
my_data = [10,20,30,40]

arr = np.array(my_data)

d = {'a':10,'b':20,'c':30,'d':40}  # create a dictionary

pd.Series(data=my_data)

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [5]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int32

Let's create two Series

In [6]:
Series1 = pd.Series([1,2,3,4,5],['IN','ENG','PK','AUS','UK'])  

# Series(data, index)

Series2 = pd.Series([1,2,3,4,5],['US','ENG','PK','AUS','UK'])

# Note: I replace India with United States and when you add two Series later on you 
#           see why you will getting NA(which represent missing value).

In [7]:
print(Series1)
print("======================")
print(Series2)

IN     1
ENG    2
PK     3
AUS    4
UK     5
dtype: int64
======================
US     1
ENG    2
PK     3
AUS    4
UK     5
dtype: int64

In [8]:
Series1 + Series2    #Note: When you add two Series your Integers are converted into float.

AUS     8.0
ENG     4.0
IN      NaN
PK      6.0
UK     10.0
US      NaN
dtype: float64

In [9]:
Series1 - Series2

AUS    0.0
ENG    0.0
IN     NaN
PK     0.0
UK     0.0
US     NaN
dtype: float64

In [10]:
Series1 * Series2

AUS    16.0
ENG     4.0
IN      NaN
PK      9.0
UK     25.0
US      NaN
dtype: float64

In [11]:
Series1 / Series2

AUS    1.0
ENG    1.0
IN     NaN
PK     1.0
UK     1.0
US     NaN
dtype: float64

# Data Frames

In [12]:
from numpy.random import randn
np.random.seed(0)                            # To get same results

In [13]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

# DataFrame(data, index, columns)

print(df)

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [14]:
df['W']

A    1.764052
B    1.867558
C   -0.103219
D    0.761038
E    1.494079
Name: W, dtype: float64

In [15]:
type(df['X'])

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
# To extract particular column we can use df['column_name'] or df.column_name
df.W        #see you get the same result as above

A    1.764052
B    1.867558
C   -0.103219
D    0.761038
E    1.494079
Name: W, dtype: float64

In [18]:
# To extract two columns together you have to use double bracket otherwise you will get an error.
df[['W','Z']]

          W         Z
A  1.764052  2.240893
B  1.867558 -0.151357
C -0.103219  1.454274
D  0.761038  0.333674
E  1.494079 -0.854096

In [19]:
# df['W','Z'] #try it yourself

### Add new Column into Data Frame

In [20]:
df['U'] = df['W']+df['X']
df

          W         X         Y         Z         U
A  1.764052  0.400157  0.978738  2.240893  2.164210
B  1.867558 -0.977278  0.950088 -0.151357  0.890280
C -0.103219  0.410599  0.144044  1.454274  0.307380
D  0.761038  0.121675  0.443863  0.333674  0.882713
E  1.494079 -0.205158  0.313068 -0.854096  1.288921

### To Drope the any column use Drop()

In [21]:
# df.drop('U')
# df

# Note: If you didn't specify the axis you will get an error
# 0 or 'index', 1 or 'columns'

df.drop(labels='U',axis=1)

# Note: In drop method there is one argument called inpalce by default it is false.
#        If you want to delete the column permanently then you have to put inplace = True.

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [22]:
df   #See U column is not deleted permanently

          W         X         Y         Z         U
A  1.764052  0.400157  0.978738  2.240893  2.164210
B  1.867558 -0.977278  0.950088 -0.151357  0.890280
C -0.103219  0.410599  0.144044  1.454274  0.307380
D  0.761038  0.121675  0.443863  0.333674  0.882713
E  1.494079 -0.205158  0.313068 -0.854096  1.288921

In [23]:
df.drop('U',axis=1,inplace=True)
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [24]:
# To check shape 
df.shape      # (rows,columns)

(5, 4)

In [25]:
# Till far we extract the data via columns. Now, do it with Rows.

In [26]:
df.loc['A']   #For location based

W    1.764052
X    0.400157
Y    0.978738
Z    2.240893
Name: A, dtype: float64

In [27]:
df.iloc[0]   #For Index based

W    1.764052
X    0.400157
Y    0.978738
Z    2.240893
Name: A, dtype: float64

#### If you want to extract any particular element which is located at n row and m column.

In [28]:
df.loc['A','X']   # A - Row and X - Column

0.4001572083672233

In [29]:
# To verify your answer you can check it in the dataframe
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [30]:
df.loc[['C','E'],['W','Z']]

          W         Z
C -0.103219  1.454274
E  1.494079 -0.854096

### Conditional Selection

In [31]:
df>0                   # Return Boolean results True and False. True for +ve and False for -ve

       W      X     Y      Z
A   True   True  True   True
B   True  False  True  False
C  False   True  True   True
D   True   True  True   True
E   True  False  True  False

In [32]:
df[df>0]              # Return original values for true case and false values are replaced by NaN

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558       NaN  0.950088       NaN
C       NaN  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079       NaN  0.313068       NaN

In [33]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [34]:
df[df['W']>0]   # Note: It returns all the rows and columns as the conditions not satisfy for C row because of having -ve value.

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [35]:
df[df['X']<0]

          W         X         Y         Z
B  1.867558 -0.977278  0.950088 -0.151357
E  1.494079 -0.205158  0.313068 -0.854096

In [36]:
# df[(df['W']>0) and (df['Z']>1)]

# Note: In Python, Series of Boolean value cannot be solved multiple python, however solved single boolean value like
#                True and False = False

# Hence produces error!!

In [37]:
df[(df['W']>0) & (df['Z']>1)]

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893

In [38]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [39]:
# In order to reset index back to default
df.reset_index()

# For Permanent you can put inplace = True

  index         W         X         Y         Z
0     A  1.764052  0.400157  0.978738  2.240893
1     B  1.867558 -0.977278  0.950088 -0.151357
2     C -0.103219  0.410599  0.144044  1.454274
3     D  0.761038  0.121675  0.443863  0.333674
4     E  1.494079 -0.205158  0.313068 -0.854096

In [40]:
# Let's add new index in place of A,B,C,D,E

new_ind = 'NY CA IN AZ NJ'.split()
new_ind

['NY', 'CA', 'IN', 'AZ', 'NJ']

In [41]:
df['States'] = new_ind
df

# But we want at the States at the first position

          W         X         Y         Z States
A  1.764052  0.400157  0.978738  2.240893     NY
B  1.867558 -0.977278  0.950088 -0.151357     CA
C -0.103219  0.410599  0.144044  1.454274     IN
D  0.761038  0.121675  0.443863  0.333674     AZ
E  1.494079 -0.205158  0.313068 -0.854096     NJ

In [42]:
df.set_index('States')

               W         X         Y         Z
States
NY      1.764052  0.400157  0.978738  2.240893
CA      1.867558 -0.977278  0.950088 -0.151357
IN     -0.103219  0.410599  0.144044  1.454274
AZ      0.761038  0.121675  0.443863  0.333674
NJ      1.494079 -0.205158  0.313068 -0.854096

### Multi Index

In [43]:
outside = ['M1','M1','M1','M2','M2','M2']
inside = [1,2,3,1,2,3]

hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

Basically, .zip is a container itself. It holds the real file inside. Similarly, Python zip is a container that holds real data inside. Python zip function takes iterable elements as input, and returns iterator.

In [44]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
M1 1 -2.552990  0.653619
   2  0.864436 -0.742165
   3  2.269755 -1.454366
M2 1  0.045759 -0.187184
   2  1.532779  1.469359
   3  0.154947  0.378163

In [45]:
df.index.names = ['Groups', 'Number']
df

                      A         B
Groups Number
M1     1      -2.552990  0.653619
       2       0.864436 -0.742165
       3       2.269755 -1.454366
M2     1       0.045759 -0.187184
       2       1.532779  1.469359
       3       0.154947  0.378163

In [46]:
df.loc['M2']

               A         B
Number
1       0.045759 -0.187184
2       1.532779  1.469359
3       0.154947  0.378163

#### Cross Section

In [47]:
" We use Cross Section only that cases when we want to access the element from both Group"
df.xs(1,level='Number')

               A         B
Groups
M1     -2.552990  0.653619
M2      0.045759 -0.187184

# Missing Data

In [48]:
data = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

You can see in this we have some missing data. Missing Data is generally represent by NaN, _ etc. And I'll later provide you the way how to deal with Large Missing Values in DataFrame.

#### Drop the NaN using dropna()

In [49]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [51]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

Thresh means keep only the rows with at least 2 non-na values in our above case

#### Fill NaN values by fillna()

In [52]:
df.fillna(value='Fill Value :P')

               A              B  C
0              1              5  1
1              2  Fill Value :P  2
2  Fill Value :P  Fill Value :P  3

In [53]:
df['A'].fillna(value=df['A'].mean())   # see how mean is calculated

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [54]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

# Group By

Group By allows you to group together rows based off of a column and perform an aggregate function on them.

In [55]:
data = {'Company':['Google','FaceBook','Apple','Amazon','Google','FaceBook','Apple','Amazon'],
       'Person':['Larry','Mark','Tim','Jeff','Sundar','Page','Steve','Bozz'],
       'Sales':[87000000,67000000,98000000,100000000,85000000,73000000,995000000,100001000]}
df = pd.DataFrame(data)
df

    Company  Person      Sales
0    Google   Larry   87000000
1  FaceBook    Mark   67000000
2     Apple     Tim   98000000
3    Amazon    Jeff  100000000
4    Google  Sundar   85000000
5  FaceBook    Page   73000000
6     Apple   Steve  995000000
7    Amazon    Bozz  100001000

In [56]:
a = df.groupby('Company')
a.mean()

              Sales
Company
Amazon    100000500
Apple     546500000
FaceBook   70000000
Google     86000000

In [57]:
a.sum()

               Sales
Company
Amazon     200001000
Apple     1093000000
FaceBook   140000000
Google     172000000

In [58]:
a.std()

                 Sales
Company
Amazon    7.071068e+02
Apple     6.342748e+08
FaceBook  4.242641e+06
Google    1.414214e+06

In [59]:
df.groupby('Company').describe()

         Sales                                                       \
         count         mean           std          min          25%
Company
Amazon     2.0  100000500.0  7.071068e+02  100000000.0  100000250.0
Apple      2.0  546500000.0  6.342748e+08   98000000.0  322250000.0
FaceBook   2.0   70000000.0  4.242641e+06   67000000.0   68500000.0
Google     2.0   86000000.0  1.414214e+06   85000000.0   85500000.0


                  50%          75%          max
Company
Amazon    100000500.0  100000750.0  100001000.0
Apple     546500000.0  770750000.0  995000000.0
FaceBook   70000000.0   71500000.0   73000000.0
Google     86000000.0   86500000.0   87000000.0

In [60]:
df.groupby('Company').describe().transpose()

Company            Amazon         Apple      FaceBook        Google
Sales count  2.000000e+00  2.000000e+00  2.000000e+00  2.000000e+00
      mean   1.000005e+08  5.465000e+08  7.000000e+07  8.600000e+07
      std    7.071068e+02  6.342748e+08  4.242641e+06  1.414214e+06
      min    1.000000e+08  9.800000e+07  6.700000e+07  8.500000e+07
      25%    1.000002e+08  3.222500e+08  6.850000e+07  8.550000e+07
      50%    1.000005e+08  5.465000e+08  7.000000e+07  8.600000e+07
      75%    1.000008e+08  7.707500e+08  7.150000e+07  8.650000e+07
      max    1.000010e+08  9.950000e+08  7.300000e+07  8.700000e+07

# Merging, Joining & Concatenating

In [61]:
df0 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  }, index = [0,1,2,3])

df1 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  }, index = [4,5,6,7])

df2 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  }, index = [8,9,10,11])

#### Concatenation

Basically, glues together DataFrames. Note: One thing keep in mind that Dimensions should match along the axis you are concatenation on. You can use pd.Concat and parse a list of DataFrames to concatenate together.

In [62]:
pd.concat([df0,df1,df2])

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [63]:
pd.concat([df0,df1,df2],axis=1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

#### Merging

In [64]:
left = pd.DataFrame({'K':['K1','K2'],
                    'A':['A1','A2'],
                    'B':['B1','B2']})

right = pd.DataFrame({'K':['K1','K2'],
                    'C':['C1','C2'],
                    'D':['D1','D2']})

pd.merge(left,right,how="inner",on='K')

# I am showing you only one join you can try yourself outer, inner etc.

    K   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2

#### Joining
Joining is a convenient method for combining the columns of two potentially differently_indexed DataFrames into a Single result DataFrame.

In [65]:
left = pd.DataFrame({
                    'A':['A1','A2'],
                    'B':['B1','B2']}, index = ['K0','k1'])

right = pd.DataFrame({
                    'C':['C1','C2'],
                    'D':['D1','D2']}, index = ['K0','k2'])

left.join(right)

     A   B    C    D
K0  A1  B1   C1   D1
k1  A2  B2  NaN  NaN

In [66]:
left.join(right,how="outer")

      A    B    C    D
K0   A1   B1   C1   D1
k1   A2   B2  NaN  NaN
k2  NaN  NaN   C2   D2

# Operations

In [67]:
df = pd.DataFrame({'Col1':[1,2,3,4,5,6,7,8,9,10,11,12],
                   'Col2':['A','B','C','D','E','F','G','H','I','J','A','B'],
                  'col3':['car','fan','water','pyth','deep','lio','carwap','sms','msms','jsjq','msms','car']})

In [68]:
df   # So this is our DataFrame

    Col1 Col2    col3
0      1    A     car
1      2    B     fan
2      3    C   water
3      4    D    pyth
4      5    E    deep
5      6    F     lio
6      7    G  carwap
7      8    H     sms
8      9    I    msms
9     10    J    jsjq
10    11    A    msms
11    12    B     car

In [69]:
df.head() # return the first 5 rows/lines by default

   Col1 Col2   col3
0     1    A    car
1     2    B    fan
2     3    C  water
3     4    D   pyth
4     5    E   deep

In [70]:
df.head(7)

   Col1 Col2    col3
0     1    A     car
1     2    B     fan
2     3    C   water
3     4    D    pyth
4     5    E    deep
5     6    F     lio
6     7    G  carwap

#### Finding a Unique value in Data Frame

In [71]:
df['Col2'].unique()

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype=object)

In [72]:
len(df['Col2'].unique())

10

In [73]:
# or
df['Col2'].nunique()

10

In [74]:
df['Col2'].value_counts()

A    2
B    2
J    1
D    1
F    1
H    1
I    1
E    1
C    1
G    1
Name: Col2, dtype: int64

#### Apply Method

In [75]:
def times(x):
    return x**2

In [76]:
df['Col1'].apply(times)

0       1
1       4
2       9
3      16
4      25
5      36
6      49
7      64
8      81
9     100
10    121
11    144
Name: Col1, dtype: int64

In [77]:
df['Col1'].apply(lambda x:x*2)

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
Name: Col1, dtype: int64

#### Drop Column

In [78]:
df.drop('Col1',axis=1)

   Col2    col3
0     A     car
1     B     fan
2     C   water
3     D    pyth
4     E    deep
5     F     lio
6     G  carwap
7     H     sms
8     I    msms
9     J    jsjq
10    A    msms
11    B     car

#### Sorting

In [79]:
df.sort_values('Col1', ascending=False)

    Col1 Col2    col3
11    12    B     car
10    11    A    msms
9     10    J    jsjq
8      9    I    msms
7      8    H     sms
6      7    G  carwap
5      6    F     lio
4      5    E    deep
3      4    D    pyth
2      3    C   water
1      2    B     fan
0      1    A     car

#### Find Null Values

In [80]:
df.isnull()

     Col1   Col2   col3
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False

In [81]:
df.isnull().sum()

Col1    0
Col2    0
col3    0
dtype: int64

### Pivot Table

 A pivot table is a similar operation that is commonly seen in spreadsheets and other programs that operate on tabular data. The pivot table takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.

In [82]:
 data = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})

df = pd.DataFrame(data)
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [83]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                   columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [84]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                 columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

# Data Input and Output

The pandas I/O API is a set of top level reader functions accessed like pandas.read_csv() that generally return a pandas object. The corresponding writer functions are object methods that are accessed like DataFrame.to_csv().

Format Type--     Data Description	
text  --	        JSON	           

text    --     	HTML	

text      --  	Local clipboard	

binary      --	MS Excel	

binary	  --      HDF5 Format	

binary	    --    Feather Format	

binary       --	Parquet Format	

binary      	--Msgpack	

binary  --    	Stata	 

binary    --  	Python 

SQL	    --        SQL	

SQL	      --      Google Big Query

"I am doing with .csv and html files here how to load the data."

In [85]:
data = pd.read_csv('movies_initial.csv')
data.head()

,imdbID,title,year,rating,runtime,genre,released,director,writer,cast,...,imdbRating,imdbVotes,poster,plot,fullplot,language,country,awards,lastupdated,type
0,1,Carmencita,1894,NOT RATED,1 min,"Documentary, Short",NaN,William K.L. Dickson,NaN,Carmencita,...,5.9,1032.0,http://ia.media-imdb.com/images/M/MV5BMjAzNDEw...,Performing on what looks like a small wooden s...,Performing on what looks like a small wooden s...,NaN,USA,NaN,2015-08-26 00:03:45.040000000,movie
1,5,Blacksmith Scene,1893,UNRATED,1 min,Short,1893-05-09,William K.L. Dickson,NaN,"Charles Kayser, John Ott",...,6.2,1189.0,NaN,Three men hammer on an anvil and pass a bottle...,A stationary camera looks at a large anvil wit...,NaN,USA,1 win.,2015-08-26 00:03:50.133000000,movie
2,3,Pauvre Pierrot,1892,NaN,4 min,"Animation, Comedy, Short",1892-10-28,mile Reynaud,NaN,NaN,...,6.7,566.0,NaN,"One night, Arlequin come to see his lover Colo...","One night, Arlequin come to see his lover Colo...",NaN,France,NaN,2015-08-12 00:06:02.720000000,movie
3,8,Edison Kinetoscopic Record of a Sneeze,1894,NaN,1 min,"Documentary, Short",1894-01-09,William K.L. Dickson,NaN,Fred Ott,...,5.9,988.0,NaN,A man (Thomas Edison's assistant) takes a pinc...,A man (Edison's assistant) takes a pinch of sn...,NaN,USA,NaN,2015-08-10 00:21:07.127000000,movie
4,10,Employees Leaving the Lumire Factory,1895,NaN,1 min,"Documentary, Short",1895-03-22,Louis Lumire,NaN,NaN,...,6.9,3469.0,NaN,A man opens the big gates to the Lumire facto...,A man opens the big gates to the Lumire facto...,NaN,France,NaN,2015-08-26 00:03:56.603000000,movie

In [86]:
html_data = pd.read_html('https://pandas.pydata.org/pandas-docs/stable/io.html')
html_data

[   Format Type      Data Description          Reader        Writer
 0         text                   CSV        read_csv        to_csv
 1         text                  JSON       read_json       to_json
 2         text                  HTML       read_html       to_html
 3         text       Local clipboard  read_clipboard  to_clipboard
 4       binary              MS Excel      read_excel      to_excel
 5       binary           HDF5 Format        read_hdf        to_hdf
 6       binary        Feather Format    read_feather    to_feather
 7       binary        Parquet Format    read_parquet    to_parquet
 8       binary               Msgpack    read_msgpack    to_msgpack
 9       binary                 Stata      read_stata      to_stata
 10      binary                   SAS        read_sas           NaN
 11      binary  Python Pickle Format     read_pickle     to_pickle
 12         SQL                   SQL        read_sql        to_sql
 13         SQL      Google Big Query        read_gbq        to_gbq]

# This is our end of Numpy Tutorial. Hope you learn something from it. Thank you!